In [1]:
from splinter import Browser
from bs4 import BeautifulSoup as soup
from pprint import pprint
from time import sleep
import pandas as pd

In [2]:
def personal_info(link):
    browser.visit(link)
    per_info_soupy = soup(browser.html, "html.parser")
    athlete = per_info_soupy.find_all("div", class_="athlete")
    country = athlete[0].find("div", class_="country").find("span").text
    name = athlete[0].find("h1", class_="name").text
    age = athlete[0].find("span", class_="age").text
    hometown = athlete[0].find("span", class_="hometown").text
    info = per_info_soupy.find("div", class_="personal-info")
    athlete_info = info.find("div",class_="text")
    catergories = []
    data = []
    Athlete_infos = []
    try:   
        for i in athlete_info:
            if i["class"][0]=="subtitle":
                catergories.append(i.text)
            else:
                data.append(i.text)

        athlete_infos = {catergories[i]: data[i] for i in range(len(catergories))}
        Athlete_infos.append(athlete_infos)
        
    except:
        "NO PERSONAL INFORMATION"
    INFO =[country,name,age, Athlete_infos]
    return INFO

In [3]:
def climbers_stats(link):
    browser.visit(link)
    soupy = soup(browser.html, "html.parser")
    iframe = soupy.find('iframe')
    iframe_url = iframe['data-src']
    iframe_url
    browser.visit(iframe_url)
    return

In [4]:
def loop_table():
    iframesoup = soup(browser.html, "html.parser")
    table = iframesoup.find('table')
    climbers =[]
    for row in table.find_all('tr'):
        try:
            link = row.find_all('td')[1].find("a")["href"]
            climber = personal_info(link)
            climbers.append(climber)

        except:
            continue
    return climbers

In [5]:
def climbers(url):
    climbers_stats(url)
    sleep(1)
    climbers = loop_table()
    return climbers

In [6]:
browser = Browser('chrome')

In [7]:
men_url = 'https://www.ifsc-climbing.org/index.php/world-competition/calendar?task=ranking-complete&category=3'
women_url = 'https://www.ifsc-climbing.org/index.php/world-competition/calendar?task=ranking-complete&category=7'

In [17]:
women = climbers(women_url)

In [9]:
men = climbers(men_url)

In [23]:
women_df = pd.DataFrame(women)
# women_df.drop([3],axis=1)

In [35]:

len(women_name_df.columns)
for i in range(len(women_name_df.columns)):
    women_name_df.rename(columns={i:f"name_{i}"}, inplace=True)

In [24]:
women_df[1]=women_df[1].str.strip()
women_name_df = women_df[1].str.split(" ",expand=True)
women_df[2]=women_df[2].str.strip("Age: ")
women_df.merge(women_name_df, left_index=True, right_index=True)

,0_x,1_x,2_x,3_x,0_y,1_y,2_y,3_y,4
0,USA,Natalia GROSSMAN,21,[{' HEIGHT ': ' 162 '}],Natalia,GROSSMAN,None,None,None
1,JPN,Miho NONAKA,25,[{' HEIGHT ': ' 163 '}],Miho,NONAKA,None,None,None
2,USA,Brooke RABOUTOU,22,[{' HEIGHT ': ' 158 '}],Brooke,RABOUTOU,None,None,None
3,GER,Hannah MEUL,22,[{' HEIGHT ': ' 167 '}],Hannah,MEUL,None,None,None
4,JPN,Futaba ITO,21,[{' HEIGHT ': ' 162 '}],Futaba,ITO,None,None,None
...,...,...,...,...,...,...,...,...,...
159,LTU,Rugile TAMOSIUNAITE,22,[],Rugile,TAMOSIUNAITE,None,None,None
160,ISR,Naama YOHAI,23,[],Naama,YOHAI,None,None,None
161,AUT,Lena SCHRITTWIESER,17,[],Lena,SCHRITTWIESER,None,None,None
162,NZL,Phoebe KENDERDINE,20,[],Phoebe,KENDERDINE,None,None,None
163,CRO,Eni MALENICA,18,[],Eni,MALENICA,None,None,None

In [21]:
women_df

,0,1,2,3,name1,name2,name3,name4,name5
0,USA,Natalia GROSSMAN,21,[{' HEIGHT ': ' 162 '}],Natalia,GROSSMAN,None,None,None
1,JPN,Miho NONAKA,25,[{' HEIGHT ': ' 163 '}],Miho,NONAKA,None,None,None
2,USA,Brooke RABOUTOU,22,[{' HEIGHT ': ' 158 '}],Brooke,RABOUTOU,None,None,None
3,GER,Hannah MEUL,22,[{' HEIGHT ': ' 167 '}],Hannah,MEUL,None,None,None
4,JPN,Futaba ITO,21,[{' HEIGHT ': ' 162 '}],Futaba,ITO,None,None,None
...,...,...,...,...,...,...,...,...,...
159,LTU,Rugile TAMOSIUNAITE,22,[],Rugile,TAMOSIUNAITE,None,None,None
160,ISR,Naama YOHAI,23,[],Naama,YOHAI,None,None,None
161,AUT,Lena SCHRITTWIESER,17,[],Lena,SCHRITTWIESER,None,None,None
162,NZL,Phoebe KENDERDINE,20,[],Phoebe,KENDERDINE,None,None,None
163,CRO,Eni MALENICA,18,[],Eni,MALENICA,None,None,None

In [ ]:
personal_info_list = pd.json_normalize(women_df[3])
personl_info_df = pd.json_normalize(personal_info_list[0])
women_df = women_df.drop([1,3],axis=1)
women_df.merge(personl_info_df,left_index=True, right_index=True)

In [ ]:
def clean_climber_df(df):
    personal_info_list = pd.json_normalize(df[3])
    personl_info_df = pd.json_normalize(personal_info_list[0])
    personl_info_df